TFM_capa_limite/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (0.09231 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform (0 0 0);
    }

    wall_membrane
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall_up
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	sides
	{
	   type             empty;
	}


	

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
