TFM_capa_limite/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    wall_membrane
    {
    type            nutkRoughWallFunction;
    Ks              uniform 0;
    Cs              uniform 0.5;
	value           uniform 0;
    }

    wall_up
    {
    type            nutkRoughWallFunction;
    Ks              uniform 0;
    Cs              uniform 0.5;
	value           uniform 0;
    }
	
	sides
	{
	   type             empty;
	}

}


// ************************************************************************* //
